divekarshubham/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/ota_pal_for_aws/ota_pal.c
/*
 * FreeRTOS OTA PAL V1.0.0
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/* C Runtime includes. */
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

/* Amazon FreeRTOS include. */
#include "FreeRTOS.h"
#include "ota.h"
#include "ota_pal.h"
#include "iot_crypto.h"
#include "core_pkcs11.h"

/* OTA_DO_NOT_USE_CUSTOM_CONFIG allows building the OTA library
 * without a custom config. If a custom config is provided, the
 * OTA_DO_NOT_USE_CUSTOM_CONFIG macro should not be defined. */
#ifndef OTA_DO_NOT_USE_CUSTOM_CONFIG
    #include "ota_config.h"
#endif

/* Include config defaults header to get default values of configs not defined
 * in ota_config.h file. */
#include "ota_config_defaults.h"

/* Renesas RX Driver Package include */
#include "platform.h"
#include "r_flash_rx_if.h"

/* Specify the OTA signature algorithm we support on this platform. */
/*const char OTA_JsonFileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha1-rsa";   / * FIX ME. * / */
const char OTA_JsonFileSignatureKey[ OTA_FILE_SIG_KEY_STR_MAX_LENGTH ] = "sig-sha256-ecdsa"; /* FIX ME. */


/* The static functions below (prvPAL_CheckFileSignature and prvPAL_ReadAndAssumeCertificate)
 * are optionally implemented. If these functions are implemented then please set the following macros in
 * aws_test_ota_config.h to 1:
 * otatestpalCHECK_FILE_SIGNATURE_SUPPORTED
 * otatestpalREAD_AND_ASSUME_CERTIFICATE_SUPPORTED
 */

/**
 * @brief Verify the signature of the specified file.
 *
 * This function should be implemented if signature verification is not offloaded
 * to non-volatile memory io functions.
 *
 * This function is called from prvPAL_Close().
 *
 * @param[in] C OTA file context information.
 *
 * @return Below are the valid return values for this function.
 * OTA_ERR_NONE if the signature verification passes.
 * OTA_ERR_SIGNATURE_CHECK_FAILED if the signature verification fails.
 * OTA_ERR_BAD_SIGNER_CERT if the if the signature verification certificate cannot be read.
 *
 */
static OtaErr_t prvPAL_CheckFileSignature( OtaFileContext_t * const C );

/**
 * @brief Read the specified signer certificate from the filesystem into a local buffer.
 *
 * The allocated memory returned becomes the property of the caller who is responsible for freeing it.
 *
 * This function is called from prvPAL_CheckFileSignature(). It should be implemented if signature
 * verification is not offloaded to non-volatile memory io function.
 *
 * @param[in] pucCertName The file path of the certificate file.
 * @param[out] ulSignerCertSize The size of the certificate file read.
 *
 * @return A pointer to the signer certificate in the file system. NULL if the certificate cannot be read.
 * This returned pointer is the responsibility of the caller; if the memory is allocated the caller must free it.
 */
static uint8_t * prvPAL_ReadAndAssumeCertificate( const uint8_t * const pucCertName,
                                                  uint32_t * const ulSignerCertSize );

/*------------------------------------------ firmware update configuration (start) --------------------------------------------*/
/* R_FLASH_Write() arguments: specify "low address" and process to "high address" */
#if defined( BSP_MCU_RX65N ) || ( BSP_MCU_RX651 ) && ( FLASH_CFG_CODE_FLASH_BGO == 1 ) && ( BSP_CFG_MCU_PART_MEMORY_SIZE == 0xe ) /* OTA supported device */
/*------------------------------------------ firmware update configuration (start) --------------------------------------------*/
/* R_FLASH_Write() arguments: specify "low address" and process to "high address" */

    #define BOOT_LOADER_LOW_ADDRESS                           FLASH_CF_BLOCK_13
    #define BOOT_LOADER_MIRROR_LOW_ADDRESS                    FLASH_CF_BLOCK_51

/* R_FLASH_Erase() arguments: specify "high address (low block number)" and process to "low address (high block number)" */
    #define BOOT_LOADER_MIRROR_HIGH_ADDRESS                   FLASH_CF_BLOCK_38
    #define BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS    FLASH_CF_BLOCK_52

    #define BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL            8
    #define BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM           6

    #define FLASH_INTERRUPT_PRIORITY                          configMAX_SYSCALL_INTERRUPT_PRIORITY /* 0(low) - 15(high) */
/*------------------------------------------ firmware update configuration (end) --------------------------------------------*/

    #define BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS     ( uint32_t ) FLASH_CF_LO_BANK_LO_ADDR
    #define BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS       ( uint32_t ) FLASH_CF_HI_BANK_LO_ADDR
    #define BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER            ( uint32_t ) ( FLASH_NUM_BLOCKS_CF - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL - BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM )

#else /* Not OTA supported device */
    #define DUMMY                                             0
    #define BOOT_LOADER_LOW_ADDRESS                           DUMMY
    #define BOOT_LOADER_MIRROR_LOW_ADDRESS                    DUMMY
    #define BOOT_LOADER_MIRROR_HIGH_ADDRESS                   DUMMY
    #define BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS    DUMMY
    #define BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_SMALL            DUMMY
    #define BOOT_LOADER_MIRROR_BLOCK_NUM_FOR_MEDIUM           DUMMY
    #define FLASH_INTERRUPT_PRIORITY                          DUMMY /* 0(low) - 15(high) */
    #define BOOT_LOADER_UPDATE_TEMPORARY_AREA_LOW_ADDRESS     DUMMY
    #define BOOT_LOADER_UPDATE_EXECUTE_AREA_LOW_ADDRESS       DUMMY
    #define BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER            DUMMY
#endif /* if defined( BSP_MCU_RX65N ) || ( BSP_MCU_RX651 ) && ( FLASH_CFG_CODE_FLASH_BGO == 1 ) && ( BSP_CFG_MCU_PART_MEMORY_SIZE == 0xe ) */

