divekarshubham/amazon-freertos/vendors/renesas/boards/rx65n-rsk/ports/ota_pal_for_aws/ota_pal.c
                if( R_FLASH_Erase( ( flash_block_address_t ) BOOT_LOADER_UPDATE_TEMPORARY_AREA_HIGH_ADDRESS, BOOT_LOADER_UPDATE_TARGET_BLOCK_NUMBER ) != FLASH_SUCCESS )
                {
                    eResult = OTA_ERR_RX_FILE_CREATE_FAILED;
                    LogError( ( "R_FLASH_Erase() returns error." ) );
                }

                while( OTA_FLASHING_IN_PROGRESS == gs_header_flashing_task )
                {
                }

                R_FLASH_Close();
                R_FLASH_Open();
                cb_func_info.pcallback = ota_flashing_callback;
                cb_func_info.int_priority = FLASH_INTERRUPT_PRIORITY;
                R_FLASH_Control( FLASH_CMD_SET_BGO_CALLBACK, ( void * ) &cb_func_info );
                load_firmware_control_block.OTA_FileContext = C;
                load_firmware_control_block.total_image_length = 0;
                load_firmware_control_block.eSavedAgentState = OtaImageStateUnknown;
                LogInfo( ( "Receive file created." ) );
                C->pFile = ( uint8_t * ) &load_firmware_control_block;
                eResult = OTA_ERR_NONE;
            }
            else
            {
                eResult = OTA_ERR_RX_FILE_CREATE_FAILED;
                LogError( ( "R_FLASH_Open() returns error." ) );
            }
        }
        else
        {
            eResult = OTA_ERR_RX_FILE_CREATE_FAILED;
            LogError( ( "Invalid context provided." ) );
        }
    }
    else
    {
        eResult = OTA_ERR_RX_FILE_CREATE_FAILED;
        LogError( ( "Invalid context provided." ) );
    }

    return eResult;
}
/*-----------------------------------------------------------*/

OtaErr_t otaPal_Abort( OtaFileContext_t * const C )
{
    LogDebug( ( "otaPal_Abort is called." ) );

    OtaErr_t eResult = OTA_ERR_NONE;

    if( ota_context_validate( C ) == R_OTA_ERR_INVALID_CONTEXT )
    {
        eResult = OTA_ERR_FILE_CLOSE;
    }

    if( OTA_ERR_NONE == eResult )
    {
        /* delete task/queue for flashing */
        if( NULL != xTask )
        {
            vTaskDelete( xTask );
            xTask = NULL;
        }

        if( NULL != xQueue )
        {
            vQueueDelete( xQueue );
            xQueue = NULL;
        }

        if( NULL != xSemaphoreFlashig )
        {
            vSemaphoreDelete( xSemaphoreFlashig );
            xSemaphoreFlashig = NULL;
        }

        if( NULL != xSemaphoreWriteBlock )
        {
            vSemaphoreDelete( xSemaphoreWriteBlock );
            xSemaphoreWriteBlock = NULL;
        }

        R_FLASH_Close();
    }

    ota_context_close( C );
    return eResult;
}
/*-----------------------------------------------------------*/

/* Write a block of data to the specified file. */
int16_t otaPal_WriteBlock( OtaFileContext_t * const C,
                           uint32_t ulOffset,
                           uint8_t * const pacData,
                           uint32_t ulBlockSize )
{
    int16_t sNumBytesWritten = R_OTA_ERR_QUEUE_SEND_FAIL;
    FLASH_BLOCK flash_block;
    static uint8_t flash_block_array[ FLASH_CF_MIN_PGM_SIZE ];
    uint8_t * packet_buffer;

    LogDebug( ( "otaPal_WriteBlock is called." ) );

    xSemaphoreTake( xSemaphoreWriteBlock, portMAX_DELAY );

    if( ( !( ulOffset % FLASH_CF_MIN_PGM_SIZE ) ) && ( !( ulBlockSize % FLASH_CF_MIN_PGM_SIZE ) ) )
    {
        packet_buffer = pvPortMalloc( ulBlockSize );
        memcpy( packet_buffer, pacData, ulBlockSize );
        packet_block_for_queue1.p_packet = packet_buffer;
        packet_block_for_queue1.ulOffset = ulOffset;
        packet_block_for_queue1.length = ulBlockSize;

        if( xQueueSend( xQueue, &packet_block_for_queue1, NULL ) == pdPASS )
        {
            sNumBytesWritten = ( int16_t ) ulBlockSize;
        }
        else
        {
            vPortFree( packet_block_for_queue1.p_packet );
            LogError( ( "OTA flashing queue send error." ) );
            sNumBytesWritten = R_OTA_ERR_QUEUE_SEND_FAIL;
        }
    }
    else
    {
        flash_block.binary = flash_block_array;

        fragmented_flash_block_list = fragmented_flash_block_list_insert( fragmented_flash_block_list, ulOffset, pacData, ulBlockSize );

        if( fragmented_flash_block_list != NULL )
        {
            while( 1 )
            {
                fragmented_flash_block_list = fragmented_flash_block_list_assemble( fragmented_flash_block_list, &flash_block );

                if( flash_block.binary != NULL )
                {
                    packet_buffer = pvPortMalloc( flash_block.length );
                    memcpy( packet_buffer, flash_block.binary, flash_block.length );
                    packet_block_for_queue1.p_packet = packet_buffer;
                    packet_block_for_queue1.ulOffset = flash_block.offset;
                    packet_block_for_queue1.length = flash_block.length;

                    if( xQueueSend( xQueue, &packet_block_for_queue1, NULL ) != pdPASS )
                    {
                        vPortFree( packet_block_for_queue1.p_packet );
                        LogError( ( "OTA flashing queue send error." ) );
                        sNumBytesWritten = R_OTA_ERR_QUEUE_SEND_FAIL;
                        break;
                    }
                }
                else
                {
                    sNumBytesWritten = ( int16_t ) ulBlockSize;
                    break;
                }
            }

            /*----------- finalize phase ----------*/
            fragmented_flash_block_list_print( fragmented_flash_block_list );
        }
        else
        {
            sNumBytesWritten = ( int16_t ) ulBlockSize;
        }
    }

    xSemaphoreGive( xSemaphoreWriteBlock );

    return sNumBytesWritten;
}
/*-----------------------------------------------------------*/

OtaErr_t otaPal_CloseFile( OtaFileContext_t * const C )
{
    OtaErr_t eResult = OTA_ERR_NONE;

    if( ota_context_validate( C ) == R_OTA_ERR_INVALID_CONTEXT )
    {
        eResult = OTA_ERR_FILE_CLOSE;
    }

    if( C->pSignature != NULL )
    {
        eResult = prvPAL_CheckFileSignature( C );
    }
    else
    {
        eResult = OTA_ERR_SIGNATURE_CHECK_FAILED;
    }

    if( OTA_ERR_NONE == eResult )
    {
        /* Update the user firmware header. */
        if( ota_context_update_user_firmware_header( C ) == R_OTA_ERR_NONE )
        {
            LogDebug( ( "User firmware header updated." ) );
        }
        else
        {
            LogError( ( "Failed to update the image header." ) );
            eResult = OTA_ERR_FILE_CLOSE;
        }

        /* delete task/queue for flashing */
        if( NULL != xTask )
        {
            vTaskDelete( xTask );
            xTask = NULL;
        }

        if( NULL != xQueue )
        {
            do
            {
                if( errQUEUE_FULL == xQueueReceive( xQueue, &packet_block_for_queue2, 0 ) )
                {
                    break;
                }
                else
                {
                    vPortFree( packet_block_for_queue2.p_packet );
                }
            }
            while( 1 );

            vQueueDelete( xQueue );
            xQueue = NULL;
        }

